DataProcessors/СМ_ВыгрузитьАвтомобилиНаСайт_LEGOCAR_RU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СМ_ВыгрузитьАвтомобилиНаСайт_LEGOCAR_RU</Name>
			<Comment>СМ Выгрузить автомобили на сайт LegoCar.ru</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныАвтомобилей</Name>
			<Comment>Цены автомобилей</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль или модель для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Comment>Вариант комплектации для которго сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидАвтомобиля</Name>
			<Comment>Вид автомобиля</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
					<Comment>Новый автомобиль</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Агентский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Выкуп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_ГосУтилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Демонстрационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_ДемоПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Зачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Конверсия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Консигнация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Корпоративный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_НаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_НеОпределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Подменный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_VND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтомобильСПробегом</Name>
					<Comment>Автомобиль с пробегом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпортБУ</Name>
					<Comment>Параллельный импорт БУ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодменныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаритетныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническийАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
					<Comment>Параллельный импорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративнаяКвота</Name>
					<Comment>Корпоративная квота</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйПарк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СМ_ВыгрузитьАвтомобилиНаСайт_LEGOCAR_RU/Ext/ObjectModule.bsl
Перем ПапкаФото;

Процедура ЛегоКарВыгрузкаАвтомобилейМодуль() Экспорт
	
	ТекЛичныйКабинет = Справочники.СМ_ЛичныеКабинеты_ЛегоКар.Выбрать();
	
	Пока ТекЛичныйКабинет.Следующий() Цикл
		СписокПодразделенийЛК = Новый СписокЗначений;
		СписокПодразделенийЛК.ЗагрузитьЗначения(ТекЛичныйКабинет.Подразделения.Выгрузить().ВыгрузитьКолонку("Подразделение"));		
 		
		СписокАвто = ПолучитьСписокАвтоОстатков(СписокПодразделенийЛК);
		МассивДанныхJSON = ВыгрузитьJSON(СписокАвто,ТекЛичныйКабинет);
		
		Если PostЗапрос(МассивДанныхJSON,ТекЛичныйКабинет) Тогда
			СМГ_Сообщить("Выпонен POST-Запрос по личному кабинету <"+ТекЛичныйКабинет+">. "+ТекущаяДата());
 		Иначе
	    	СМГ_Сообщить("Ошибка! Не выполнен POST-Запрос по личному кабинету <"+ТекЛичныйКабинет+">. "+ТекущаяДата(),СтатусСообщения.ОченьВажное);
 		КонецЕсли; 
	КонецЦикла;	
 	
КонецПроцедуры // ЛегоКарВыгрузкаАвтомобилейМодуль 

Функция PostЗапрос(МассивДанныхJSON,ЛичныйКабинет)
	
	Перем БезОшибок;
	
	БезОшибок = Ложь;
	
	//Создали запись ЗаписьJSON
	ЗаписьJSON = Новый ЗаписьJSON;
	//Задаем параметры без переноса строк, можно и с переносом, как кому нравится
	тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
	ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
	
	//СтруктураДанныхJSON = Новый Структура; 
	
	// вставляем наш массив в еще одну структуру
	//Бондаренко++ 20220711
 	//СтруктураДанныхJSON.Вставить("test", МассивДанныхJSON);
	//СтруктураДанныхJSON.Вставить("", МассивДанныхJSON);
	//Бондаренко-- 20220711
	
	//ЗаписатьJSON(ЗаписьJSON, СтруктураДанныхJSON);
	
	//Бондаренко++ 20220712
	ЗаписатьJSON(ЗаписьJSON, МассивДанныхJSON);
	//Бондаренко-- 20220712
	
	//Здесь нам платформа переделала нашу сложную структуру в строку данных в формате JSON 
	СтрокаJS = ЗаписьJSON.Закрыть();
	//СтрокаJS = "["+СтрокаJS+"]";
	//В этот файл для примера наш сайт сформирует ответ после отправки на него данных методом POST
	//ФайлОтвета = КаталогВременныхФайлов()+ "answer.txt";
	
	//Если Отладка Тогда
	//	СМГ_Сообщить("Файл ответа "+ФайлОтвета);
 	//КонецЕсли;
 	
	//здесь надо указать путь к сайту
	
	//  Если ДилерскийЦентр = Справочники.ДилерскиеЦентры.Дельта Тогда
	//    URL = "cars.hyundai.sokolmotors.ru";
	//	Логин = "chupina_y@sokolmotors.ru";
	//ИначеЕсли ДилерскийЦентр = Справочники.ДилерскиеЦентры.ХендэШахты Тогда	
	//	URL = "cars.hyundai-sh.sokolmotors.ru";
	//	Логин = "pankova_e@hyundai-sokolmotors.ru";
	// КонецЕсли; 
	// Пароль = "Sokolmotors2019";  
	
  	АдресСайта = СокрЛП(ЛичныйКабинет.АдресСайта)+"/dealer/api/exchange";
	Логин      = СокрЛП(ЛичныйКабинет.Логин);
 	Пароль     = СокрЛП(ЛичныйКабинет.Пароль);  
	
	HTTPСоединение = Новый HTTPСоединение(АдресСайта,443,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),Истина);
 	
	//создаем запрос данных методом POST
 	запросPOST = Новый HTTPЗапрос("/dealer/api/exchange"); 
	
	//это обязательный заголовок тела запроса
	//Если ДилерскийЦентр = Справочники.ДилерскиеЦентры.Дельта Тогда
	//	запросPOST.Заголовки.Вставить("Host",  "cars.hyundai.sokolmotors.ru");
	//ИначеЕсли ДилерскийЦентр = Справочники.ДилерскиеЦентры.ХендэШахты Тогда	
	//	запросPOST.Заголовки.Вставить("Host",  "cars.hyundai-sh.sokolmotors.ru");
	// КонецЕсли;
	
	запросPOST.Заголовки.Вставить("Host",  СокрЛП(АдресСайта));
  	запросPOST.Заголовки.Вставить("Content-type", "application/json"); //charset=utf-8");

	//Если ДилерскийЦентр = Справочники.ДилерскиеЦентры.Дельта Тогда
	//	запросPOST.Заголовки.Вставить("User", "chupina_y@sokolmotors.ru Sokolmotors2019");
	//ИначеЕсли ДилерскийЦентр = Справочники.ДилерскиеЦентры.ХендэШахты Тогда		
	//	запросPOST.Заголовки.Вставить("User", "pankova_e@hyundai-sokolmotors.ru Sokolmotors2019");
	//КонецЕсли;	                                                                          
 	запросPOST.Заголовки.Вставить("User", СокрЛП(Логин)+" "+СокрЛП(Пароль));

	запросPOST.Заголовки.Вставить("Testmode", "0");   //“1”, для отключения обновления данных товара, “0” для “боевого режима”.

	запросPOST.Заголовки.Вставить("Method", "cars");
	запросPOST.Заголовки.Вставить("charset", "UTF-8");
 	
	//Здесь задаем текст нашей отформатированной строки + задаем формат строки 
	запросPOST.УстановитьТелоИзСтроки(СтрокаJS,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	
	//посылаем запрос
	ВыполненПостЗапрос = Истина;
 	Попытка
	   Рез = HTTPСоединение.ВызватьHTTPМетод("POST", запросPOST);
  	Исключение
	   ВыполненПостЗапрос = Ложь;
	КонецПопытки; 
	
	Если ВыполненПостЗапрос Тогда
		Попытка
			СМГ_Сообщить(Рез.ПолучитьТелоКакСтроку()+" Код ответа = '"+Рез.КодСостояния+"'");
		Исключение
			//	
		КонецПопытки;
	КонецЕсли;
     	
	Возврат ВыполненПостЗапрос;
  	
КонецФункции
 
Функция ПолучитьСписокАвтоОстатков(СписокПодразделений)
	
	СписокАвто = Новый СписокЗначений;
	ТаблицаАвто = ПолучитьТаблицуАвто();
 	
	СписокПодразделений = ПолучитьПолныйСписокПодразделений(СписокПодразделений);
	
	Для каждого Стр Из ТаблицаАвто Цикл
 		Если СписокПодразделений.НайтиПоЗначению(Стр.Подразделение) = Неопределено  Тогда
			Продолжить;				
		КонецЕсли;
		Если СписокАвто.НайтиПоЗначению(Стр.Автомобиль) <> Неопределено Тогда
			Продолжить;				                                                                    	
		КонецЕсли;
		Если НЕ ЭтоНовыйАвтомобиль(Стр.Автомобиль) Тогда
			Продолжить;				                                                                    					
		КонецЕсли;
		Если Стр.Автомобиль.Модель.Марка <> Справочники.Марка.HYUNDAI Тогда
			Продолжить;				                                                                    								
 		КонецЕсли;
		СписокАвто.Добавить(Стр.Автомобиль);
	КонецЦикла;
	
	Возврат СписокАвто;
	
КонецФункции // СписокАвтоОстатковИзаказов(ТаблицаВыгрузкиПолная)
 
Функция ПолучитьПолныйСписокПодразделений(ИсхСписок)
	
	ПолныйСписокПодразделений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка,
	|	ПодразделенияКомпании.Родитель.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	(ПодразделенияКомпании.Родитель В (&ИсхСписок)
	|			ИЛИ ПодразделенияКомпании.Ссылка В (&ИсхСписок))";
	
	Запрос.УстановитьПараметр("ИсхСписок", ИсхСписок);
	
	ПолныйСписокПодразделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат ПолныйСписокПодразделений;
	
КонецФункции

Функция ПолучитьТаблицуАвто()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Объект ССЫЛКА Справочник.Автомобили
	|			И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ИспользоватьДляТестДрайва)
	|			И ЗначенияСвойствОбъектов.Значение = ИСТИНА) КАК АвтоТестДрайва
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = АвтоТестДрайва.Объект
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	|	И АвтоТестДрайва.Объект ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение"; 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьТаблицуАвто(СписокАвто)

Функция СформироватьСтруктуруАвто(ТекАвто,ЛичныйКабинет)

		СтруктураАвто = Новый Структура;
		СтруктураАвто.Вставить("vin",СокрЛП(ТекАвто.VIN));
  		СтруктураАвто.Вставить("name",СокрЛП(СтрЗаменить(ВРЕГ(ТекАвто.Модель.Наименование),ВРЕГ(ТекАвто.Модель.Марка.Наименование),"")));
 		СтруктураАвто.Вставить("code",СокрЛП(ТекАвто.ВариантКомплектации.Артикул));
		СтруктураАвто.Вставить("codeColor",СокрЛП(ТекАвто.Цвет.Артикул));
		СтруктураАвто.Вставить("codeCover",СокрЛП(ТекАвто.ЦветСалонаАвтомобиля.Артикул));                     //код обивки салона (стока);
 		СтруктураАвто.Вставить("year",СокрЛП(Формат(ТекАвто.ГодВыпуска,"ДФ=yyyy")));
		
		ЦенаАвто = ПолучитьЦенуАвто(ТекАвто);
		
		СтруктураАвто.Вставить("price",  Число(СокрЛП(СтрЗаменить(ЦенаАвто,Символы.НПП,""))));  
        СтруктураАвто.Вставить("special", Число(СокрЛП(СтрЗаменить(ТекАвто.СпециальнаяЦена,Символы.НПП,""))));  
		СтруктураАвто.Вставить("credit", Число(СокрЛП(СтрЗаменить(ЦенаАвто,Символы.НПП,""))));  
        СтруктураАвто.Вставить("discountCredit", Число(СокрЛП(СтрЗаменить(ТекАвто.СкидкаПриПокупкеВКредит,Символы.НПП,""))));  
        СтруктураАвто.Вставить("discountTradein",Число(СокрЛП(СтрЗаменить(ТекАвто.СкидаПриПокупкеВТрейдИн,Символы.НПП,""))));  
		
		ТекстКлассифайда = "";
		ТекстКлассифайда = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("ТекстКлассифайда",ТекАвто.ПолучитьОбъект());
        СтруктураАвто.Вставить("offer",ТекстКлассифайда);
		
		Если ЕстьЛиПереходВСобственность(ТекАвто) Тогда
			СтруктураАвто.Вставить("pts",1); 
		Иначе	
		    СтруктураАвто.Вставить("pts",0); 
		КонецЕсли; 
        СтруктураАвто.Вставить("stock","авто в наличии"); // пример авто в наличии,
        СтруктураАвто.Вставить("run",0); 
        СтруктураАвто.Вставить("used",0); 
		
 		СтруктураАвто.Вставить("codeDealerCenter",СокрЛП(ЛичныйКабинет.КодДилера));
		
		СтруктураАвто.Вставить("autoru",0);
		СтруктураАвто.Вставить("drom",0);
		СтруктураАвто.Вставить("feed_offer","");  //описание для фидов, текст (Autoru и Drom); 
 		
		Если ТекАвто.ПутьКФото.Количество() > 0 Тогда
 			МассивФото = Новый Массив;
			Для каждого СтрТЧ Из ТекАвто.ПутьКФото Цикл 
	  			МассивФото.Добавить(ПапкаФото+СокрЛП(ТекАвто.УникальныйИдентификатор())+"/"+СтрТЧ.GUID+".jpg");
 			КонецЦикла;                                 
			СтруктураАвто.Вставить("images",МассивФото);
		КонецЕсли;
 		
  		Возврат СтруктураАвто;

КонецФункции // СформироватьСтруктуруАвто(ТекАвто,ЛичныйКабинет)

Функция ВыгрузитьJSON(СписокАвто,ЛичныйКабинет)
	
	МассивДанныхJSON = Новый Массив;
	
	Для каждого Авто Из СписокАвто Цикл
		
		ТекАвто = Авто.Значение;
		
		ВариантКомплектации = СокрЛП(Сред(ТекАвто.ВариантКомплектации.Артикул,1,14));
 		Если СтрДлина(ВариантКомплектации) < 14 Тогда
			СМГ_Сообщить("Пропущен VIN "+СокрЛП(ТекАвто.VIN)+" из-за длины артикула варианта комплектации, которая меньше 14: "+ВариантКомплектации);
			Продолжить;
 		КонецЕсли; 
		
		Если СтрДлина(СокрЛП(ТекАвто.VIN)) = 17 Тогда
			СтруктураДанныхАвто = СформироватьСтруктуруАвто(ТекАвто,ЛичныйКабинет);
			МассивДанныхJSON.Добавить(СтруктураДанныхАвто);
 		КонецЕсли;
		 
 	КонецЦикла; 
  	
	Возврат МассивДанныхJSON;
	
КонецФункции  

Функция ЕстьЛиПереходВСобственность(Авто)

	ЕстьПереходВСобственность = Ложь;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	              	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен КАК Проведен,
	              	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация КАК ХозОперация,
	              	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Ссылка КАК Ссылка,
	              	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
	              	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль1
	              	|ИЗ
	              	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	              	|ГДЕ
	              	|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен = ИСТИНА
	              	|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПереходВСобственностьАвтомобилей)
	              	|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль",Авто);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
 	Если ТЗ.Количество() > 0 Тогда
		ЕстьПереходВСобственность = Истина;	
 	КонецЕсли;

	Возврат ЕстьПереходВСобственность;

КонецФункции // ЕстьпереходВСобственность()
 
Функция ПолучитьЦенуАвто(Автомобиль)
	
	ПолнаяЦенаПродажи = 0.00;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныАвтомобилейСрезПоследних.ТипЦен,
		|	ЦеныАвтомобилейСрезПоследних.Автомобиль,
		|	ЦеныАвтомобилейСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
		|ГДЕ
		|	ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)
		|	И ЦеныАвтомобилейСрезПоследних.Автомобиль = &Автомобиль";  
	
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПолнаяЦенаПродажи = ВыборкаДетальныеЗаписи.Цена + Автомобиль.СтоимостьДопОборудования;
	КонецЦикла;
	
	Возврат ПолнаяЦенаПродажи;
 
КонецФункции // ПолучитьЦенуАвто(Автомобиль)

Функция ЭтоНовыйАвтомобиль(Автомобиль)
	
	ЭтоНовый = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Автомобиль,
		|	АвтомобилиСрезПоследних.ВидЗначения,
		|	АвтомобилиСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
		|	И АвтомобилиСрезПоследних.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	Запрос.УстановитьПараметр("Значение", Перечисления.ВидАвтомобиля.Новый);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтоНовый = Истина;
	КонецЦикла;

	Возврат ЭтоНовый;
 
КонецФункции // ЭтоНовыйАвтомобиль(Автомобиль)

ПапкаФото = "https://it.sokolmotors.ru/alfaauto-noauth/hs/advert/photo/";
